2012-08-28-errors-in-epydoc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Fixing Errors in Epydoc</title>
<!-- 2013-11-12 Tue 16:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Bastian Bechtold" />
<link rel="alternate" type="appliation/rss+xml"
                href="http://bastibe.de/rss.xml"
                title="RSS feed for bastibe.de">
          <link href='http://fonts.googleapis.com/css?family=Roboto&subset=latin' rel='stylesheet' type='text/css'>
          <link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono' rel='stylesheet' type='text/css'>
          <link href= "static/style.css" rel="stylesheet" type="text/css" />
          <title>Basti's Scratchpad on the Internet</title>
          <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8" />
          <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
</head>
<body>
<div id="preamble" class="status">
<div class="header">
              <a href="http://bastibe.de">Basti's Scratchpad on the Internet</a>
              <div class="sitelinks">
                  <a href="http://alpha.app.net/bastibe">alpha.app.net</a>  | <a href="http://github.com/bastibe">Github</a>
              </div>
          </div>
</div>
<div id="content">
<h1 class="title">Fixing Errors in Epydoc</h1>
<p>
I ran into this error twice now and wasted an hour both times, so it is time to put this on my universal scratchpad, i.e. this blog.
</p>

<p>
If you ever get this error when using <a href="http://epydoc.sourceforge.net/">epydoc</a>:
</p>

<pre class="example">
UNEXPECTED ERROR:
'Text' object has no attribute 'data'
</pre>

<p>
You are probably running a version of Python that is greater than the latest one that is supported by epydoc. This is because epydoc has not been updated since 2008 and Python 2.5.
</p>

<p>
Luckily, some <a href="http://www.agapow.net/programming/python/epydoc-go-boom">fine</a> <a href="http://stackoverflow.com/questions/6704770/epydoc-attributeerror-text-object-has-no-attribute-data">folks</a> on the internet have figured out how to fix these things.
</p>

<p>
Short answer: Find your <i>site-packages</i> directory:
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #718c00;">from</span> distutils.sysconfig <span style="color: #718c00;">import</span> get_python_lib
<span style="color: #718c00;">print</span>(get_python_lib())
</pre>
</div>

<p>
Go there, navigate to the <i>epydoc\/markup</i> directory and change line 307 of the file <i>restructuredtext.py</i> from
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #eab700;">m</span> = <span style="color: #718c00;">self</span>._SUMMARY_RE.match(child.data)
</pre>
</div>

<p>
to
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #718c00;">try</span>:
    <span style="color: #eab700;">m</span> = <span style="color: #718c00;">self</span>._SUMMARY_RE.match(child.data)
<span style="color: #718c00;">except</span> <span style="color: #4271ae;">AttributeError</span>:
    <span style="color: #eab700;">m</span> = <span style="color: #4271ae;">None</span>
</pre>
</div>

<p>
This should fix that problem.
</p>
</div>
<div id="postamble" class="status">
<div id="archive"><a href="archive.html">Other posts</a></div>
              <div id="disqus_thread"></div>
              <script type="text/javascript">
              /* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
              var disqus_shortname = 'bastibe';
              /* * * DON'T EDIT BELOW THIS LINE * * */
              (function() {
                var dsq = document.createElement('script');
                dsq.type = 'text/javascript';
                dsq.async = true;
                dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
                (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                  })();
              </script>
              <noscript>Please enable JavaScript to view the
                  <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
              <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</div>
</body>
</html>
